// task_8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//static 

#include <iostream>

int main()
{
	int i, n, m=0;
	int a[5] = { 6, 5, 8, 9, 3 };
	int* p = &a[0];
	std :: cin >> n;
	for (i=0; i<5; i++){
		if (abs(p[i]) == abs(n)) {
			m = m + 1;
		}
		else
			std::cout << p[i]<<' ';	    
  }
	if (m > 0) {
		for (int k = 1; k <= m; k++) {
			std::cout << '0' << ' ';
		}
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
