// matrix.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int j;
    int matrix[2][6] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 };
    std::cout << "matrix[2][6] = { ";
    for (j = 0; j < 6; j++) {
        std::cout << *(&matrix[0][j]) << ' ';
    }
    for (j = 0; j < 6; j++) {
        std::cout << *(&matrix[1][j]) << ' ';
    }
    std::cout << '}'<<' ';
    int sum1 = 0;
    int sum2 = 0;
    for (j = 0; j < 6; j++) {
        int x = *(&matrix[0][j]);
        sum1 = sum1 + x;
    }
    std::cout << sum1 << ' ';
    for (j = 0; j < 6; j++) {
        int y = *(&matrix[1][j]);
        sum2 = sum2 + y;
    }
    std::cout << sum2<<' ';
    std::cout << "new_matrix = { ";
    if (sum1 >= sum2) {

        for (j = 0; j < 6; j++) {
            std::cout << *(&matrix[0][j]) << ' ';
        }
        for (j = 0; j < 6; j++) {
            std::cout << *(&matrix[1][j]) << ' ';
        }
    }
    else
    {

        for (j = 0; j < 6; j++) {
            std::cout << *(&matrix[1][j]) << ' ';
        }
        for (j = 0; j < 6; j++) {
            std::cout << *(&matrix[0][j]) << ' ';
        }
    }
    std::cout << '}';
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
